package section5.calendar;

import java.util.Date;

public class Application01 {

	public static void main(String[] args) {
		/* Date 클래스
		 * jdk1.0부터 날짜를 취급하기 위해 사용되는 Date 클래스는
		 * 생성자를 비롯하여 대부분의 메소드가 Deprecated 되어 이싸.
		 * 
		 * Deprecated
		 * 향후 버전이 업데이트 되면서 사라지게 될 기능이니 가급적이면 사용을 권장하지 않는다는 의미이다.
		 * 하지만 하위 버전의 호환성 때문에 한 번에 제거된 것은 아니고 남겨두었기 떄문에 사용하는 것은 가능하다.*/

		/* jdk1.1 부터는 새롭게 제공되는 Calendar 클래스를 이용하여 날짜와 시간에 관한 처리를 하게 된다.
		 * 하지만 Calendar 클래스는 몇 가지 문제를 가지고 있다.
		 * 1. Calendar 인스턴스는 불변객체가 아닌기 떄문에 값을 수정할 수 없다.
		 * 2. 윤초(leap second)를 고려하지 않는다.
		 * 윤초란?
		 * 협정 세계시에서 사용하는 세슘 원자시계와 실제 지구의 자전/공정 속도를 기준으로 한 태양시의 차이로 인해
		 * 발생한 오차르 ㄹ보정하기 위해 추가하는 1초이다.
		 * 12월 31일의 마지막에 추가하거나, 혹은 6월 30일의 마지막에 추가한다.
		 * 윤초는 사소해 보이지만 실제 2012년도 링크드인과 같은 대규모 서비스의 서버를 마비시킨 버그를 발생한 적도 있따.
		 * 3. Calendar 클래스는 월을 나타낼 때 0부터 11까지로 표현하는 불편함이 있다.
		 * 
		 * jdk1.8에서는 이러한 모든 문제를 해결할 수 있는 time 패키지를 제공하고 있는데
		 * 이후 파트에 살펴 볼 것이다.
		 * 
		 * Date는 java.sql.Date와 java.util.Date가 존재한다.
		 * 한 클래스에서 두개의 타입을 전부 사용하게 되면 import를 하더라도 사용하는 타입이
		 * 어느 패키지에 있는 Date 클래스인지에 대한 모호성이 발생하게 된다.
		 * 따라서 import를 해도 폴 클래스의 이름을 작성해줘야 한다.*/
		
		/* Date 클래스는 두 가지 생성 방법이 존재한다.
		 * 나머지는 Deprecated 되어 있다.*/
		
		// 1. 기본생성자를 사용하는 방법
		// 기본 생성자로 인스턴스를 생성하면 운영체제의 날짜.시간.정보를 이용해서 인스턴스를 만들게 된다.
		java.util.Date today = new java.util.Date();
		System.out.println(today);
		
		// 2. Date(long date) 사용하는 방법
		// getTime() : 1970년 1월 1일 0시 0분 0초 이후 지난 시간을 millisecond로 계산해서 long타입으로 반환한다.
		System.out.println(today.getTime());
		
		/* 콘솔에 출력된 긴 숫자를 복사해서 생성자의 인자로 전달한다.
		 * 단 long 타입의 리터럴에 맞게 뒤에 L을 붙인다.*/
		Date time = new Date(1682997554938L);
		
		/* 아까 실행했을 당시 그 시간이 나오게 된다.
		 * 즉 특정 날짜.시간 정보를 이용해서 Date 인스턴스를 생성하기 위해서는 해당 방법만이 존재한다.
		 * 하지만 계싼하려면 매우 복잡하다.
		 * 하루 = 24시간. 1시간 = 60분 , 1분 60초, 1초 1000밀리초
		 * 1000*60*60*24가 하루가 된다.*/
		
		System.out.println(time);
		
	}

}
